Revit 2020 API
GenericImportOptions Class
Generic Import options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public abstract class GenericImportOptions
Visual Basic
Public MustInherit Class GenericImportOptions
Visual C++
public ref class GenericImportOptions abstract
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GenericImportOptions
 Autodesk.Revit.DB.ImageImportOptions
See Also
GenericImportOptions Members
Autodesk.Revit.DB Namespace